Revit 2026 API

# RebarUpdateCurvesDataAreOrientationOptionsChanged Property

---

Indicates if the orientation options have changed since the last regeneration.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AreOrientationOptionsChanged { get; }
```
```vb
Public ReadOnly Property AreOrientationOptionsChanged As Boolean
	Get
```
```cpp
public:
property bool AreOrientationOptionsChanged {
	bool get ();
}
```
```fsharp
member AreOrientationOptionsChanged : bool with get
```

#### Property Value

Boolean

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace